betoslava/STM32WL33_Radio_Modular/STM32Cube_FW_WL3_V1.3.0/Middlewares/ST/wMBus/DataLink/Src/stm32wl3_wMBus_DataLink.c
/**
  ******************************************************************************
  * @file    stm32wl3_wMBus_DataLink.c
  * @author  MCD Application Team
  * @brief   wM-Bus DataLink module driver.
  *          This file provides firmware functions to manage the wM-Bus DataLink driver
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32wl3x_hal.h"
#include "stm32wl3_wMBus_DataLink.h"

#include <string.h>

/** @addtogroup STM32WL3_wM-Bus
  * @{
  */

/** @addtogroup DataLink
  * @{
  */

/** @defgroup DataLink_Private_Variables DataLink Private Variables
  * @{
  */
uint8_t *rxBuffer;        /*!< Pointer to the RX buffer */
uint16_t rxBufferLength;  /*!< Length of the RX buffer */
uint8_t new_Rx_frame = 0; /*!< Flag indicating a new RX frame */

static uint8_t wMBus_RxBuffer[WMBUS_RADIO_BUFFER_SIZE];   /*!< Static buffer for wM-Bus RX data */
uint16_t wMBus_RxBuffer_length = WMBUS_RADIO_BUFFER_SIZE; /*!< Length of the wM-Bus RX buffer */
int32_t wMBus_RssiDbm = 0;                                /*!< RSSI value in dBm for the received frame */
uint32_t wMBus_RxSync;                                    /*!< Synchronization word for RX */

static uint64_t TxCompletedTimeStamp = 0; /*!< Timestamp of the last completed TX */
static uint64_t PreTxTimestamp = 0;       /*!< Timestamp before the last TX */
static uint64_t RxCompletedTimeStamp = 0; /*!< Timestamp of the last completed RX */

wMBus_DataLink_frame_t RxFrame = {0}; /*!< DataLink Rx Frame*/
wMBus_DataLink_frame_t TxFrame = {0}; /*!< DataLink Tx Frame*/

static uint8_t access_no = 0x00;      /*!< Access number for the frame */

volatile wMBus_DataLink_state_t wMBus_DataLink_state = DL_SM_IDLE; /*!< Current state of the DataLink state machine */

wMBus_DataLink_attributes_t wMBus_DataLink_attr = 
{
  .DevType = METER,
  .MField = {0, 0},
  .AField = {0, 0, 0, 0, 0, 0},
  .LinkFrameFormat = WMBUS_FORMAT_A,
  .LinkFreqAccessCycle = 0,
  .LinkTimeout = 10000,
  .direction = METER_TO_OTHER,
  .submode = C_MODE
};

/**
  * @brief Define LinkTimeout in us depending on mode.
  */
const uint32_t wMBus_LinkTimeout[WMBUS_MODE_NUMBER] =
{
  20000, /**< T-mode: 20000us=20ms */
  15000, /**< S-mode: 15000us=15ms */
  10000, /**< S1M-mode: 10000us=10ms */
  10000, /**< C-mode: 10000us=10ms */
  10000, /**< N-mode - N2a: 10000us=10ms */
  10000, /**< N-mode - N2b: 10000us=10ms */
  10000, /**< N-mode - N2c: 10000us=10ms */
  10000, /**< N-mode - N2d: 10000us=10ms */
  10000, /**< N-mode - N2e: 10000us=10ms */
  10000, /**< N-mode - N2f: 10000us=10ms */
  10000  /**< N-mode - N2g: 10000us=10ms */
};
/**
  * @}
  */

/** @defgroup DataLink_Private_Functions DataLink Private Functions
  * @{
  */
/**
  * @brief Set the TX buffer based on the frame format.
  *
  * @param frame Frame be transmitted.
  * @param framePtr pointer to the frame buffer.
  * @return uint8_t length of the TX buffer.
  */
wMBus_DataLink_status_t _setFrame(wMBus_DataLink_frame_t *frame, uint8_t **framePtr);

/**
  * @brief Parse a received wM-Bus frame from the provided buffer.
  *
  * @param rxBuff Pointer to the buffer containing the received frame.
  * @param rxBufLen Length of the received buffer.
  * @return wMBus_DataLink_status_t Status of the operation.
  */
wMBus_DataLink_status_t _receiveFrame(uint8_t *rxBuff, uint16_t rxBufLen);

wMBus_DataLink_status_t _setFrame(wMBus_DataLink_frame_t *frame, uint8_t **framePtr)
{
  static uint8_t localFrame[WMBUS_RADIO_BUFFER_SIZE];
  uint8_t *localFramePtr = localFrame;

  /* Length-field (L):(C + M + A) + (CI + all subsequent bytes (excluding crc) */
  frame->l_field = DATALINK_LAYER_OFFSET + CI_FIELD_SIZE + frame->data_field.size;

  if (wMBus_DataLink_attr.LinkFrameFormat == WMBUS_FORMAT_B)
  {
    /* Adapt L-field to B format: depend on the size of the packet add +2 CRC bytes or +4 */
    if (frame->l_field <= ((uint8_t)WMBUS_FIRST_BLOCK_SIZE_FORMAT_B + (uint8_t)WMBUS_SECOND_BLOCK_SIZE_FORMAT_B - CRC_FIELD_SIZE))
    {
      frame->l_field += CRC_FIELD_SIZE;
    }
    else
    {
      frame->l_field += 2 * CRC_FIELD_SIZE;
    }
  }

  *localFramePtr++ = frame->l_field; /* L-field */

  /* ******************** 1st block ******************** */
  *localFramePtr++ = frame->c_field;        /* C-field */
  memcpy(localFramePtr, frame->m_field, 2); /* M-field */
  localFramePtr += 2;
  memcpy(localFramePtr, frame->a_field, 6); /* A-field */
  localFramePtr += 6;

  /* ******************** 2nd block + data-field ******************** */
  *localFramePtr++ = frame->ci_field; /* CI-field */

  memcpy(localFramePtr, frame->data_field.payload, frame->data_field.size);

  *framePtr = localFrame;

  return LINK_STATUS_SUCCESS;
}

wMBus_DataLink_status_t _receiveFrame(uint8_t *rxBuff, uint16_t rxBuffLen)
{
  int16_t dataBytesRemaining = rxBuffLen;
  uint8_t blockDataSize = 0;

  if (wMBus_DataLink_attr.LinkFrameFormat == WMBUS_FORMAT_A)
  {
    if (rxBuffLen < (WMBUS_FIRST_BLOCK_SIZE_FORMAT_A - CRC_FIELD_SIZE))
    {
      return LINK_STATUS_FRAME_ERROR;
    }
    RxFrame.l_field = rxBuff[0];            /* L-field */
    RxFrame.c_field = rxBuff[1];            /* C-field */
    memcpy(RxFrame.m_field, &rxBuff[2], 2); /* M-field */
    memcpy(RxFrame.a_field, &rxBuff[4], 6); /* A-field */

    /* Update remaining bytes considering 1st block size(12bytes) without CRC(2bytes) */
    dataBytesRemaining = dataBytesRemaining - (WMBUS_FIRST_BLOCK_SIZE_FORMAT_A - CRC_FIELD_SIZE);
    if (dataBytesRemaining < 0)
    {
      return LINK_STATUS_FRAME_ERROR;
    }

