betoslava/STM32WL33_Radio_Modular/STM32Cube_FW_WL3_V1.3.0/Middlewares/ST/wMBus/DataLink/Src/stm32wl3_wMBus_DataLink.c
    /* ******************** 2nd block ******************** */
    RxFrame.ci_field = rxBuff[10]; /* CI-field */

    dataBytesRemaining = dataBytesRemaining - CI_FIELD_SIZE;
    memcpy(RxFrame.data_field.payload, &rxBuff[WMBUS_FIRST_BLOCK_SIZE_FORMAT_A + CI_FIELD_SIZE - CRC_FIELD_SIZE], dataBytesRemaining);
    RxFrame.data_field.size = dataBytesRemaining;
  }
  else if (wMBus_DataLink_attr.LinkFrameFormat == WMBUS_FORMAT_B)
  {
    if (rxBuffLen < WMBUS_FIRST_BLOCK_SIZE_FORMAT_B)
    {
      return LINK_STATUS_FRAME_ERROR;
    }
    RxFrame.l_field = rxBuff[0];            /* L-field */
    RxFrame.c_field = rxBuff[1];            /* C-field */
    memcpy(RxFrame.m_field, &rxBuff[2], 2); /* M-field */
    memcpy(RxFrame.a_field, &rxBuff[4], 6); /* A-field */

    /* Update remaining bytes considering 1st block size(10bytes) */
    dataBytesRemaining = dataBytesRemaining - WMBUS_FIRST_BLOCK_SIZE_FORMAT_B;

    /* ******************** 2nd block ******************** */
    RxFrame.ci_field = rxBuff[10]; /* CI-field */

    /* Determine second block size (118 bytes) - CI-field(1byte) */
    if (dataBytesRemaining <= (WMBUS_SECOND_BLOCK_SIZE_FORMAT_B - CI_FIELD_SIZE))
    {
      blockDataSize = dataBytesRemaining - CI_FIELD_SIZE;
    }
    else
    {
      blockDataSize = WMBUS_SECOND_BLOCK_SIZE_FORMAT_B - CI_FIELD_SIZE;
    }
    memcpy(RxFrame.data_field.payload, &rxBuff[WMBUS_FIRST_BLOCK_SIZE_FORMAT_B + CI_FIELD_SIZE], blockDataSize); /* Data-field */
    RxFrame.data_field.size = blockDataSize;                                                                     /* Data-field size */

    /* Update remaining bytes considering 2nd block size(118bytes) */
    dataBytesRemaining = dataBytesRemaining - blockDataSize + CI_FIELD_SIZE;

    /* ******************** Optional block ******************** */
    if (dataBytesRemaining)
    {
      /* Determine optional block size (128 bytes) */
      blockDataSize = dataBytesRemaining;
      memcpy(&RxFrame.data_field.payload[RxFrame.data_field.size], &rxBuff[(uint8_t)WMBUS_FIRST_BLOCK_SIZE_FORMAT_B + (uint8_t)WMBUS_SECOND_BLOCK_SIZE_FORMAT_B], blockDataSize - CRC_FIELD_SIZE); /* Data-field */
      RxFrame.data_field.size = RxFrame.data_field.size + blockDataSize - CRC_FIELD_SIZE;                                                                                                          /* Data-field size */
    }
  }
  else
  {
    return LINK_STATUS_NOT_PERMITTED;
  }
  return LINK_STATUS_SUCCESS;
}
/**
  * @}
  */

/** @defgroup DataLink_Exported_Functions DataLink Exported Functions
  * @{
  */
wMBus_DataLink_status_t wMBus_DataLink_init(uint8_t *m_field, uint8_t *a_field, wMBus_Phy_meter_modes_t dev_type, wMBus_Phy_submode_t submode, wMBus_Phy_frame_format_t frame_format, wMBus_Phy_direction_t direction)
{
  /* Static arrays to hold the last received M-field, A-field and payload */
  static uint8_t RxMField[2];
  static uint8_t RxAField[6];
  static uint8_t RxPayload[WMBUS_RADIO_BUFFER_SIZE];

  /* Set device type */
  wMBus_DataLink_attr.DevType = dev_type;

  /* Copy M-field and A-field attributes */
  memcpy(wMBus_DataLink_attr.MField, m_field, 2);
  memcpy(wMBus_DataLink_attr.AField, a_field, 6);

  /* Set frame format, direction and other link attributes */
  wMBus_DataLink_attr.LinkFrameFormat = frame_format;
  wMBus_DataLink_attr.direction = direction;
  wMBus_DataLink_attr.submode = submode;
  wMBus_DataLink_attr.LinkTimeout = wMBus_LinkTimeout[submode]; // Timeout value in milliseconds
  wMBus_DataLink_attr.LinkFreqAccessCycle = 0;

  /* Set RxFrame fields to point to the static arrays */
  RxFrame.m_field = RxMField;
  RxFrame.a_field = RxAField;
  RxFrame.data_field.payload = RxPayload;

  /* Set TxFrame fields to point to the wMBus_DataLink_attr fields */
  TxFrame.m_field = wMBus_DataLink_attr.MField;
  TxFrame.a_field = wMBus_DataLink_attr.AField;

  /* Set the Link Layer state to idle */
  wMBus_DataLink_state = DL_SM_IDLE;

  /* Initialize the wM-Bus PHY layer */
  wMBus_Phy_init(wMBus_DataLink_attr.submode, wMBus_DataLink_attr.direction, wMBus_DataLink_attr.LinkFrameFormat);
  wMBus_DataLink_Timer_Init();
  wMBus_Phy_register_LL_buffer(wMBus_RxBuffer, &wMBus_RxBuffer_length, (uint8_t *)&wMBus_DataLink_attr.LinkFrameFormat, &wMBus_RxSync, &wMBus_RssiDbm);

#ifdef WMBUS_DEBUG
  wMBus_Phy_initialize_debug_log();
#endif

  return LINK_STATUS_SUCCESS;
}

void wMBus_DataLink_state_machine(void)
{
  wMBus_DataLink_C_field_t resp = DL_NO_FRAME;
  uint8_t ret_val = SUCCESS;
  uint8_t ret_val2 = SUCCESS;
  uint8_t ret_val4 = SUCCESS;
  wMBus_Phy_tRO_t timing;
  timing = wMBus_Phy_getTiming();

  HAL_MRSUBG_TIMER_Tick();

  switch (wMBus_DataLink_state)
  {
  case DL_SM_IDLE:
    break;
  case DL_SM_SEND_NKE:
    reset_VTimer_Flags();
    ret_val = HAL_MRSUBG_TIMER_StartVirtualTimer(&timerHandle, timing.tRO_min - (HAL_MRSUBG_TIMER_GetCurrentSysTime() - RxCompletedTimeStamp));
    HAL_MRSUBG_TIMER_Tick();
    if (ret_val == SUCCESS)
    {
      while (!(VTimer_Callback_flag == 1))
      { // wait until tRO_min expired
        HAL_MRSUBG_TIMER_Tick();
      }
      wMBus_Phy_init(wMBus_DataLink_attr.submode, OTHER_TO_METER, wMBus_DataLink_attr.LinkFrameFormat);
      wMBus_DataLink_send_SND_NKE(&rxBuffer, &rxBufferLength);
      wMBus_Phy_abort();
      reset_VTimer_Flags();
    }
    wMBus_Phy_init(wMBus_DataLink_attr.submode, wMBus_DataLink_attr.direction, wMBus_DataLink_attr.LinkFrameFormat);
    wMBus_DataLink_state = DL_SM_IDLE;
    break;
  case DL_SM_SENT_SND_IR:
    reset_VTimer_Flags();
    ret_val = HAL_MRSUBG_TIMER_StartVirtualTimer(&timerHandle, timing.tRO_min - (HAL_MRSUBG_TIMER_GetCurrentSysTime() - TxCompletedTimeStamp));
    ret_val2 = HAL_MRSUBG_TIMER_StartVirtualTimer(&timerHandle2, timing.tRO_max - (HAL_MRSUBG_TIMER_GetCurrentSysTime() - TxCompletedTimeStamp) + wMBus_DataLink_attr.LinkTimeout);
    HAL_MRSUBG_TIMER_Tick();
    if ((ret_val == SUCCESS) && (ret_val2 == SUCCESS))
    {
      while (!(VTimer_Callback_flag == 1))
      { // wait until tRO_min expired
        HAL_MRSUBG_TIMER_Tick();
      }
      while (!(VTimer_Callback_flag == 1) && !(VTimer_Callback2_flag == 0))
      { // wait until tRO_min expired and tRO_max not expired: This should not happen
        HAL_MRSUBG_TIMER_Tick();
      }
      wMBus_Phy_init(wMBus_DataLink_attr.submode, OTHER_TO_METER, wMBus_DataLink_attr.LinkFrameFormat);
      wMBus_DataLink_startRx();

