betoslava/STM32WL33_Radio_Modular/STM32Cube_FW_WL3_V1.3.0/Middlewares/ST/wMBus/DataLink/Src/stm32wl3_wMBus_DataLink.c
      while (!(VTimer_Callback2_flag == 1))
      { // until tRO_max expired
#ifdef PROCESS_FRAME
        wMBus_DataLink_receive_frame(&RxFrame);
#else
        wMBus_DataLink_receive_frame(&rxBuffer, &rxBufferLength);
#endif
        HAL_MRSUBG_TIMER_Tick();
      }
      wMBus_Phy_abort();
      reset_VTimer_Flags();
    }
    wMBus_Phy_init(wMBus_DataLink_attr.submode, wMBus_DataLink_attr.direction, wMBus_DataLink_attr.LinkFrameFormat);
    wMBus_DataLink_state = DL_SM_IDLE;
    break;
  case DL_SM_SEND_CNF_IR:
    reset_VTimer_Flags();
    ret_val = HAL_MRSUBG_TIMER_StartVirtualTimer(&timerHandle, timing.tRO_min - (HAL_MRSUBG_TIMER_GetCurrentSysTime() - RxCompletedTimeStamp));
    HAL_MRSUBG_TIMER_Tick();
    if (ret_val == SUCCESS)
    {
      while (!(VTimer_Callback_flag == 1))
      { // wait until tRO_min expired
        HAL_MRSUBG_TIMER_Tick();
      }
      wMBus_Phy_init(wMBus_DataLink_attr.submode, OTHER_TO_METER, wMBus_DataLink_attr.LinkFrameFormat);
      wMBus_DataLink_send_CNF_IR(&rxBuffer, &rxBufferLength);
      wMBus_Phy_abort();
      reset_VTimer_Flags();
    }
    wMBus_Phy_init(wMBus_DataLink_attr.submode, wMBus_DataLink_attr.direction, wMBus_DataLink_attr.LinkFrameFormat);
    wMBus_DataLink_state = DL_SM_IDLE;
    break;
  case DL_SM_SENT_SND_NR:
    reset_VTimer_Flags();
    ret_val = HAL_MRSUBG_TIMER_StartVirtualTimer(&timerHandle, timing.tRO_min - (HAL_MRSUBG_TIMER_GetCurrentSysTime() - TxCompletedTimeStamp));
    ret_val2 = HAL_MRSUBG_TIMER_StartVirtualTimer(&timerHandle2, timing.tRO_max - (HAL_MRSUBG_TIMER_GetCurrentSysTime() - TxCompletedTimeStamp) + wMBus_DataLink_attr.LinkTimeout);
    HAL_MRSUBG_TIMER_Tick();
    if ((ret_val == SUCCESS) && (ret_val2 == SUCCESS))
    {
      while (!(VTimer_Callback_flag == 1))
      { // wait until tRO_min expired
        HAL_MRSUBG_TIMER_Tick();
      }

      while (!(VTimer_Callback_flag == 1) && !(VTimer_Callback2_flag == 0))
      { // wait until tRO_min expired and tRO_max not expired: This should not happen
        HAL_MRSUBG_TIMER_Tick();
      }
      wMBus_Phy_init(wMBus_DataLink_attr.submode, OTHER_TO_METER, wMBus_DataLink_attr.LinkFrameFormat);
      wMBus_DataLink_startRx();

      while (!(VTimer_Callback2_flag == 1))
      { // until tRO_max expired
#ifdef PROCESS_FRAME
        wMBus_DataLink_receive_frame(&RxFrame);
#else
        wMBus_DataLink_receive_frame(&rxBuffer, &rxBufferLength);
#endif
        HAL_MRSUBG_TIMER_Tick();
      }
      wMBus_Phy_abort();
      reset_VTimer_Flags();
    }
    wMBus_Phy_init(wMBus_DataLink_attr.submode, wMBus_DataLink_attr.direction, wMBus_DataLink_attr.LinkFrameFormat);
    if ((RxFrame.c_field == DL_SND_UD) || (RxFrame.c_field == DL_SND_UD2))
    {
      reset_VTimer_Flags();
      ret_val4 = HAL_MRSUBG_TIMER_StartVirtualTimer(&timerHandle4, (wMBus_Phy_getTxD() * 1000) - (HAL_MRSUBG_TIMER_GetCurrentSysTime() - PreTxTimestamp));
      if (ret_val4 == SUCCESS)
      {
        while (!(VTimer_Callback4_flag == 1))
        { // wait until tXD expired
          HAL_MRSUBG_TIMER_Tick();
        }
        if ((RxFrame.c_field == DL_SND_UD))
        {
          wMBus_DataLink_send_ACK(&rxBuffer, &rxBufferLength);
        }
        else if (RxFrame.c_field == DL_SND_UD2)
        {
          wMBus_DataLink_send_RSP_UD(&rxBuffer, &rxBufferLength);
        }
        else if (RxFrame.c_field == DL_REQ_UD1)
        {
          resp = wMBus_DataLink_received_REQ_UD1();
          if (resp == DL_ACK)
          {
            wMBus_DataLink_send_ACK(&rxBuffer, &rxBufferLength);
          }
          else if (resp == DL_RSP_UD)
          {
            wMBus_DataLink_send_RSP_UD(&rxBuffer, &rxBufferLength);
          }
        }
        else if (RxFrame.c_field == DL_REQ_UD2)
        {
          wMBus_DataLink_send_RSP_UD(&rxBuffer, &rxBufferLength);
        }
        wMBus_Phy_abort();
        VTimer_Callback4_flag = 0;
      }
    }
    wMBus_DataLink_state = DL_SM_IDLE;
    break;
  case DL_SM_SEND_SND_UD:
    reset_VTimer_Flags();
    ret_val = HAL_MRSUBG_TIMER_StartVirtualTimer(&timerHandle, timing.tRO_min - (HAL_MRSUBG_TIMER_GetCurrentSysTime() - RxCompletedTimeStamp));
    HAL_MRSUBG_TIMER_Tick();
    if (ret_val == SUCCESS)
    {
      while (!(VTimer_Callback_flag == 1))
      { // wait until tRO_min expired
        HAL_MRSUBG_TIMER_Tick();
      }
      wMBus_Phy_init(wMBus_DataLink_attr.submode, OTHER_TO_METER, wMBus_DataLink_attr.LinkFrameFormat);
      wMBus_DataLink_send_SND_UD(&rxBuffer, &rxBufferLength);
      wMBus_Phy_abort();
      reset_VTimer_Flags();
    }
    wMBus_Phy_init(wMBus_DataLink_attr.submode, wMBus_DataLink_attr.direction, wMBus_DataLink_attr.LinkFrameFormat);
    wMBus_DataLink_state = DL_SM_IDLE;
    break;
  case DL_SM_SEND_SND_UD2:
    reset_VTimer_Flags();
    ret_val = HAL_MRSUBG_TIMER_StartVirtualTimer(&timerHandle, timing.tRO_min - (HAL_MRSUBG_TIMER_GetCurrentSysTime() - RxCompletedTimeStamp));
    HAL_MRSUBG_TIMER_Tick();
    if (ret_val == SUCCESS)
    {
      while (!(VTimer_Callback_flag == 1))
      { // wait until tRO_min expired
        HAL_MRSUBG_TIMER_Tick();
      }
      wMBus_Phy_init(wMBus_DataLink_attr.submode, OTHER_TO_METER, wMBus_DataLink_attr.LinkFrameFormat);
      wMBus_DataLink_send_SND_UD2(&rxBuffer, &rxBufferLength);
      wMBus_Phy_abort();
      reset_VTimer_Flags();
    }
    wMBus_Phy_init(wMBus_DataLink_attr.submode, wMBus_DataLink_attr.direction, wMBus_DataLink_attr.LinkFrameFormat);
    wMBus_DataLink_state = DL_SM_IDLE;
    break;
  case DL_SM_SEND_REQ_UD1:
    reset_VTimer_Flags();
    ret_val = HAL_MRSUBG_TIMER_StartVirtualTimer(&timerHandle, timing.tRO_min - (HAL_MRSUBG_TIMER_GetCurrentSysTime() - RxCompletedTimeStamp));
    HAL_MRSUBG_TIMER_Tick();
    if (ret_val == SUCCESS)
    {
      while (!(VTimer_Callback_flag == 1))
      { // wait until tRO_min expired
        HAL_MRSUBG_TIMER_Tick();
      }
      wMBus_Phy_init(wMBus_DataLink_attr.submode, OTHER_TO_METER, wMBus_DataLink_attr.LinkFrameFormat);
      wMBus_DataLink_send_REQ_UD1(&rxBuffer, &rxBufferLength);
      wMBus_Phy_abort();
      reset_VTimer_Flags();
    }
    wMBus_Phy_init(wMBus_DataLink_attr.submode, wMBus_DataLink_attr.direction, wMBus_DataLink_attr.LinkFrameFormat);
    wMBus_DataLink_state = DL_SM_IDLE;
    break;
  case DL_SM_SEND_REQ_UD2:
    reset_VTimer_Flags();
    ret_val = HAL_MRSUBG_TIMER_StartVirtualTimer(&timerHandle, timing.tRO_min - (HAL_MRSUBG_TIMER_GetCurrentSysTime() - RxCompletedTimeStamp));
    HAL_MRSUBG_TIMER_Tick();
    if (ret_val == SUCCESS)
    {
      while (!(VTimer_Callback_flag == 1))
      { // wait until tRO_min expired
        HAL_MRSUBG_TIMER_Tick();
      }
      wMBus_Phy_init(wMBus_DataLink_attr.submode, OTHER_TO_METER, wMBus_DataLink_attr.LinkFrameFormat);
      wMBus_DataLink_send_REQ_UD2(&rxBuffer, &rxBufferLength);
      wMBus_Phy_abort();
      reset_VTimer_Flags();
    }
    wMBus_Phy_init(wMBus_DataLink_attr.submode, wMBus_DataLink_attr.direction, wMBus_DataLink_attr.LinkFrameFormat);
    wMBus_DataLink_state = DL_SM_IDLE;
    break;
  case DL_SM_SEND_ACK:
    reset_VTimer_Flags();
    ret_val = HAL_MRSUBG_TIMER_StartVirtualTimer(&timerHandle, timing.tRO_min - (HAL_MRSUBG_TIMER_GetCurrentSysTime() - RxCompletedTimeStamp));
    HAL_MRSUBG_TIMER_Tick();
    if (ret_val == SUCCESS)
    {
      while (!(VTimer_Callback_flag == 1))
      { // wait until tRO_min expired
        HAL_MRSUBG_TIMER_Tick();
      }
      wMBus_Phy_init(wMBus_DataLink_attr.submode, OTHER_TO_METER, wMBus_DataLink_attr.LinkFrameFormat);
      wMBus_DataLink_send_ACK(&rxBuffer, &rxBufferLength);
      wMBus_Phy_abort();
      reset_VTimer_Flags();
    }
    wMBus_Phy_init(wMBus_DataLink_attr.submode, wMBus_DataLink_attr.direction, wMBus_DataLink_attr.LinkFrameFormat);
    wMBus_DataLink_state = DL_SM_IDLE;
    break;
  case DL_SM_SENT_ACC_DMD:
    reset_VTimer_Flags();
    ret_val = HAL_MRSUBG_TIMER_StartVirtualTimer(&timerHandle, timing.tRO_min - (HAL_MRSUBG_TIMER_GetCurrentSysTime() - TxCompletedTimeStamp));
    ret_val2 = HAL_MRSUBG_TIMER_StartVirtualTimer(&timerHandle2, timing.tRO_max - (HAL_MRSUBG_TIMER_GetCurrentSysTime() - TxCompletedTimeStamp) + wMBus_DataLink_attr.LinkTimeout);
    HAL_MRSUBG_TIMER_Tick();
    if ((ret_val == SUCCESS) && (ret_val2 == SUCCESS))
    {
      while (!(VTimer_Callback_flag == 1))
      { // wait until tRO_min expired
        HAL_MRSUBG_TIMER_Tick();
      }
      while (!(VTimer_Callback_flag == 1) && !(VTimer_Callback2_flag == 0))
      { // wait until tRO_min expired and tRO_max not expired: This should not happen
        HAL_MRSUBG_TIMER_Tick();
      }
      wMBus_Phy_init(wMBus_DataLink_attr.submode, OTHER_TO_METER, wMBus_DataLink_attr.LinkFrameFormat);
      wMBus_DataLink_startRx();

