betoslava/STM32WL33_Radio_Modular/STM32Cube_FW_WL3_V1.3.0/Middlewares/ST/wMBus/DataLink/Src/stm32wl3_wMBus_DataLink.c
      while (!(VTimer_Callback2_flag == 1))
      { // until tRO_max expired
#ifdef PROCESS_FRAME
        wMBus_DataLink_receive_frame(&RxFrame);
#else
        wMBus_DataLink_receive_frame(&rxBuffer, &rxBufferLength);
#endif
        HAL_MRSUBG_TIMER_Tick();
      }
      wMBus_Phy_abort();
      reset_VTimer_Flags();
    }
    wMBus_Phy_init(wMBus_DataLink_attr.submode, wMBus_DataLink_attr.direction, wMBus_DataLink_attr.LinkFrameFormat);
    wMBus_DataLink_state = DL_SM_IDLE;
    break;
  case DL_INVALID_EVENT:
    /* Invalid event, reset to idle */
    wMBus_DataLink_state = DL_SM_IDLE;
    break;
  default:
    /* Unknown state, reset to idle */
    wMBus_DataLink_state = DL_SM_IDLE;
    break;
  }
}

void wMBus_DataLink_send_frame(wMBus_DataLink_C_field_t c_field, wMBus_DataLink_CI_field_t ci_field, uint8_t *data, uint8_t length, uint8_t **rxBuf, uint16_t *rxBufferLen)
{
  uint8_t *framePtr;
  uint8_t frameLength;

  /* Prepare the frame */
  TxFrame.c_field = c_field;
  TxFrame.ci_field = ci_field;
  TxFrame.data_field.payload = data;
  TxFrame.data_field.size = length;

  _setFrame(&TxFrame, &framePtr);
  frameLength = TxFrame.l_field + 1;

  wMBus_Phy_abort();
  PreTxTimestamp = HAL_MRSUBG_TIMER_GetCurrentSysTime();
  wMBus_Phy_prepare_Tx_CRC_mngt(framePtr, frameLength, wMBus_DataLink_attr.LinkFrameFormat);
  wMBus_Phy_start_transmission();
  while (!wMBus_Phy_check_radio_events(WMBUS_TX_COMPLETED));

  TxCompletedTimeStamp = HAL_MRSUBG_TIMER_GetCurrentSysTime();

  if (wMBus_DataLink_attr.DevType == METER)
  {
    switch (c_field)
    {
    case DL_SND_NR:
      wMBus_DataLink_state = DL_SM_SENT_SND_NR;
      wMBus_DataLink_state_machine();
      break;
    case DL_SND_IR:
      wMBus_DataLink_state = DL_SM_SENT_SND_IR;
      wMBus_DataLink_state_machine();
      break;
    case DL_ACC_DMD:
      wMBus_DataLink_state = DL_SM_SENT_ACC_DMD;
      wMBus_DataLink_state_machine();
      break;
    default:
      /* Unknown C-Field */
      break;
    }
  }

  /* Save RX pointers */
  *rxBuf = rxBuffer;
  *rxBufferLen = rxBufferLength;
}

wMBus_DataLink_status_t wMBus_DataLink_startRx()
{
  new_Rx_frame = 0;
  wMBus_Phy_abort();
  wMBus_Phy_prepare_Rx();
  wMBus_Phy_start_continuousRx();

  return LINK_STATUS_SUCCESS;
}

#ifdef PROCESS_FRAME
wMBus_DataLink_status_t wMBus_DataLink_receive_frame(wMBus_DataLink_frame_t *frame)
{
#else
wMBus_DataLink_status_t wMBus_DataLink_receive_frame(uint8_t **rxBuf, uint16_t *rxBufferLen)
{
#endif
  wMBus_DataLink_C_field_t resp = DL_NO_FRAME;
  if (wMBus_DataLink_attr.DevType == OTHER)
  {
    wMBus_DataLink_startRx();
  }

  if (wMBus_DataLink_attr.DevType == METER)
  {
    /* wait for WMBUS_RX_VALID_SYNC_DETECTED event flag set */
    while (!wMBus_Phy_check_radio_events(WMBUS_RX_VALID_SYNC_DETECTED))
    {
      /* while no sync is received - we can check other event */
      HAL_MRSUBG_TIMER_Tick();
      if (VTimer_Callback2_flag == 1)
      {
        wMBus_Phy_abort();
        return PHY_RX_TIMEOUT;
      }
    }

    // allow extra time to receive the entire packet
    VTimer_Callback3_flag = 0;
    if (HAL_MRSUBG_TIMER_StartVirtualTimerMs(&timerHandle3, LINK_TIMEOUT) != SUCCESS)
    {
      return PHY_RX_TIMEOUT;
    }
  }

  /* now wait for CRC OK*/
  while (!wMBus_Phy_check_radio_events(WMBUS_RX_COMPLETED_WITH_VALID_CRC))
  {
    /* while no valid packet is received - we can check other event */
    if (wMBus_Phy_check_radio_events(WMBUS_RX_COMPLETED_WITH_CRC_ERROR) == 1)
    {
      return PHY_RX_COMPLETED_WITH_CRC_ERROR;
    }
    if (wMBus_Phy_check_radio_events(WMBUS_FIRST_CRC_ERROR) == 1)
    {
      return PHY_FIRST_CRC_ERROR;
    }
    if (wMBus_Phy_check_radio_events(WMBUS_RX_VALID_HEADER_ERROR) == 1)
    {
      return PHY_RX_VALID_HEADER_ERROR;
    }
    if (wMBus_Phy_check_radio_events(WMBUS_RX_OVERFLOW_ERROR) == 1)
    {
      return PHY_RX_OVERFLOW_ERROR;
    }
    HAL_MRSUBG_TIMER_Tick();

    if (wMBus_DataLink_attr.DevType == METER)
    {
      if (VTimer_Callback3_flag == 1)
      {
        wMBus_Phy_abort();
        return PHY_RX_TIMEOUT;
      }
    }
    else if (wMBus_DataLink_attr.DevType == OTHER)
    {
      if (VTimer_Callback2_flag == 1)
      {
        wMBus_Phy_abort();
        return PHY_RX_TIMEOUT;
      }
    }
  }

  RxCompletedTimeStamp = HAL_MRSUBG_TIMER_GetCurrentSysTime();
  new_Rx_frame = 1;

  // A valid packet has been received, parse it into the RxFrame structure
  wMBus_DataLink_status_t status = _receiveFrame(wMBus_RxBuffer, wMBus_RxBuffer_length);
  if (status != LINK_STATUS_SUCCESS)
  {
    return status; // Return error if parsing the frame fails
  }
#ifdef PROCESS_FRAME
  // Copy the parsed frame into the provided RxFrame structure
  memcpy(frame, &RxFrame, sizeof(wMBus_DataLink_frame_t));
#else
  /* here it means valid packet has been received */
  *rxBuf = wMBus_RxBuffer;
  *rxBufferLen = wMBus_RxBuffer_length;
#endif

  if (wMBus_DataLink_attr.DevType == OTHER)
  {
    switch (RxFrame.c_field)
    {
    case DL_SND_IR:
      wMBus_DataLink_state = DL_SM_SEND_CNF_IR;
      wMBus_DataLink_state_machine();
      break;
    case DL_ACC_DMD:
      wMBus_DataLink_state = DL_SM_SEND_ACK;
      wMBus_DataLink_state_machine();
      break;
    case DL_SND_NR:
      resp = wMBus_DataLink_received_SND_NR();
      if (resp == DL_SND_UD)
      {
        wMBus_DataLink_state = DL_SM_SEND_SND_UD;
        wMBus_DataLink_state_machine();
      }
      else if (resp == DL_SND_UD2)
      {
        wMBus_DataLink_state = DL_SM_SEND_SND_UD2;
        wMBus_DataLink_state_machine();
      }
      else if (resp == DL_SND_NKE)
      {
        wMBus_DataLink_state = DL_SM_SEND_NKE;
        wMBus_DataLink_state_machine();
      }
      else if (resp == DL_REQ_UD1)
      {
        wMBus_DataLink_state = DL_SM_SEND_REQ_UD1;
        wMBus_DataLink_state_machine();
      }
      else if (resp == DL_REQ_UD2)
      {
        wMBus_DataLink_state = DL_SM_SEND_REQ_UD2;
        wMBus_DataLink_state_machine();
      }
      else if (resp == DL_NO_FRAME)
      {
        break;
      }
      break;
    default:
      return LINK_STATUS_SUCCESS;
      break;
    }
  }
  else
  {
    return LINK_STATUS_SUCCESS;
  }

  return LINK_STATUS_SUCCESS;
}

