betoslava/STM32WL33_Radio_Modular/STM32Cube_FW_WL3_V1.3.0/Middlewares/ST/wMBus/DataLink/Src/stm32wl3_wMBus_DataLink.c
/* ******************** Callbacks ******************** */
__weak wMBus_DataLink_status_t wMBus_DataLink_send_CNF_IR(uint8_t **rxBuf, uint16_t *rxBufferLen)
{
  wMBus_DataLink_C_field_t c_field = DL_CNF_IR;
  wMBus_DataLink_CI_field_t ci_field = CI_EN13757_3_SHORT_TPL;
  uint8_t data[12] = {RxFrame.a_field[0], RxFrame.a_field[1], RxFrame.a_field[2], RxFrame.a_field[3], RxFrame.m_field[0], RxFrame.m_field[1], RxFrame.a_field[4], RxFrame.a_field[5], 0x00, 0x00, 0x00, 0x00};
  uint8_t length = 12;
  if (RxFrame.data_field.size > 0)
  {
    data[8] = RxFrame.data_field.payload[0]; // Copy ACC from SND-IR
  }
  wMBus_DataLink_send_frame(c_field, ci_field, data, length, rxBuf, rxBufferLen);

  return LINK_STATUS_SUCCESS;
}

__weak wMBus_DataLink_status_t wMBus_DataLink_send_ACK(uint8_t **rxBuf, uint16_t *rxBufferLen)
{
  wMBus_DataLink_C_field_t c_field = DL_ACK;
  wMBus_DataLink_CI_field_t ci_field = CI_EN13757_3_SHORT_TPL;
  uint8_t data[12] = {RxFrame.a_field[0], RxFrame.a_field[1], RxFrame.a_field[2], RxFrame.a_field[3], RxFrame.m_field[0], RxFrame.m_field[1], RxFrame.a_field[4], RxFrame.a_field[5], 0x00, 0x00, 0x00, 0x00};
  uint8_t length = 12;
  if (RxFrame.data_field.size > 9)
  {
    data[8] = RxFrame.data_field.payload[8]; // Copy ACC from Received Frame
  }
  wMBus_DataLink_send_frame(c_field, ci_field, data, length, rxBuf, rxBufferLen);

  return LINK_STATUS_SUCCESS;
}

__weak wMBus_DataLink_status_t wMBus_DataLink_send_RSP_UD(uint8_t **rxBuf, uint16_t *rxBufferLen)
{
  wMBus_DataLink_C_field_t c_field = DL_RSP_UD;
  wMBus_DataLink_CI_field_t ci_field = CI_EN13757_3_SHORT_TPL;
  uint8_t data[15] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
  uint8_t length = 15;
  if (RxFrame.data_field.size > 9)
  {
    data[0] = RxFrame.data_field.payload[8]; // Copy ACC from Received Frame
  }
  wMBus_DataLink_send_frame(c_field, ci_field, data, length, rxBuf, rxBufferLen);

  return LINK_STATUS_SUCCESS;
}

__weak wMBus_DataLink_C_field_t wMBus_DataLink_received_SND_NR()
{
  return DL_SND_UD;
}

__weak wMBus_DataLink_C_field_t wMBus_DataLink_received_REQ_UD1()
{
  return DL_ACK;
}

__weak wMBus_DataLink_status_t wMBus_DataLink_send_SND_UD(uint8_t **rxBuf, uint16_t *rxBufferLen)
{
  wMBus_DataLink_C_field_t c_field = DL_SND_UD;
  wMBus_DataLink_CI_field_t ci_field = CI_EN13757_3_SHORT_TPL;

  uint8_t data[15] = {RxFrame.a_field[0], RxFrame.a_field[1], RxFrame.a_field[2], RxFrame.a_field[3], RxFrame.m_field[0], RxFrame.m_field[1], RxFrame.a_field[4], RxFrame.a_field[5], access_no++, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
  uint8_t length = 15;
  wMBus_DataLink_send_frame(c_field, ci_field, data, length, rxBuf, rxBufferLen);

  return LINK_STATUS_SUCCESS;
}

__weak wMBus_DataLink_status_t wMBus_DataLink_send_SND_UD2(uint8_t **rxBuf, uint16_t *rxBufferLen)
{
  wMBus_DataLink_C_field_t c_field = DL_SND_UD2;
  wMBus_DataLink_CI_field_t ci_field = CI_EN13757_3_SHORT_TPL;
  uint8_t data[15] = {RxFrame.a_field[0], RxFrame.a_field[1], RxFrame.a_field[2], RxFrame.a_field[3], RxFrame.m_field[0], RxFrame.m_field[1], RxFrame.a_field[4], RxFrame.a_field[5], access_no++, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
  uint8_t length = 15;
  wMBus_DataLink_send_frame(c_field, ci_field, data, length, rxBuf, rxBufferLen);

  return LINK_STATUS_SUCCESS;
}

__weak wMBus_DataLink_status_t wMBus_DataLink_send_SND_NKE(uint8_t **rxBuf, uint16_t *rxBufferLen)
{
  wMBus_DataLink_C_field_t c_field = DL_SND_NKE;
  wMBus_DataLink_CI_field_t ci_field = CI_EN13757_3_SHORT_TPL;
  uint8_t data[12] = {RxFrame.a_field[0], RxFrame.a_field[1], RxFrame.a_field[2], RxFrame.a_field[3], RxFrame.m_field[0], RxFrame.m_field[1], RxFrame.a_field[4], RxFrame.a_field[5], access_no++, 0x00, 0x00, 0x00};
  uint8_t length = 12;
  wMBus_DataLink_send_frame(c_field, ci_field, data, length, rxBuf, rxBufferLen);

  return LINK_STATUS_SUCCESS;
}

__weak wMBus_DataLink_status_t wMBus_DataLink_send_REQ_UD1(uint8_t **rxBuf, uint16_t *rxBufferLen)
{
  wMBus_DataLink_C_field_t c_field = DL_REQ_UD1;
  wMBus_DataLink_CI_field_t ci_field = CI_EN13757_3_SHORT_TPL;
  uint8_t data[12] = {RxFrame.a_field[0], RxFrame.a_field[1], RxFrame.a_field[2], RxFrame.a_field[3], RxFrame.m_field[0], RxFrame.m_field[1], RxFrame.a_field[4], RxFrame.a_field[5], access_no++, 0x00, 0x00, 0x00};
  uint8_t length = 12;
  wMBus_DataLink_send_frame(c_field, ci_field, data, length, rxBuf, rxBufferLen);

  return LINK_STATUS_SUCCESS;
}

__weak wMBus_DataLink_status_t wMBus_DataLink_send_REQ_UD2(uint8_t **rxBuf, uint16_t *rxBufferLen)
{
  wMBus_DataLink_C_field_t c_field = DL_REQ_UD2;
  wMBus_DataLink_CI_field_t ci_field = CI_EN13757_3_SHORT_TPL;
  uint8_t data[12] = {RxFrame.a_field[0], RxFrame.a_field[1], RxFrame.a_field[2], RxFrame.a_field[3], RxFrame.m_field[0], RxFrame.m_field[1], RxFrame.a_field[4], RxFrame.a_field[5], access_no++, 0x00, 0x00, 0x00};
  uint8_t length = 12;
  wMBus_DataLink_send_frame(c_field, ci_field, data, length, rxBuf, rxBufferLen);

  return LINK_STATUS_SUCCESS;
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */